Repository: mrfatbeard/popo
Catalog: messages_*.po
Languages: ru

# no_active_user_found
source: User not found
ru: Пользователь не найден

source: Incorrect password
ru: Неверный пароль

source: Username should contain only digits
ru: Имя пользователя должно содержать только цифры

source: Incorrect pincode
ru: Неверный пин-код

source: Cashdesk not activated
ru: Касса не активирована

source: Failed to check for updates
ru: Не удалось проверить наличие обновлений

# menu_item_not_found
source: Menu item with id=%1 not found
ru: Элемент меню с id=%1 не найден

# too_much_modifiers_for_group
source: Too much modifiers for group '%1', max count is %2
ru: Слишком много модификаторов для группы '%1', максимум %2

source: Too much modifiers for dish
ru: Слишком много модификаторов для блюда

source: Activation code is not specified
ru: Код активации не указан

source: There is no such activation code
ru: Такого кода активации не существует

source: This activation code has already been used
ru: Этот код активации уже использован

source: The activation code is too old
ru: Код активации устарел

source: Refresh token does not exist
ru: Токен обновления не существует

source: Restaurant not found
ru: Ресторан не найден

source: Restaurant is not serviced
ru: Ресторан не обслуживается

# should_add_modifiers_from_following_groups
source: Should add modifiers from following groups: %1
ru: Необходимо добавить модификаторы из следующих групп: %1

source: Device connection error
ru: Ошибка подключения устройства

# different_item_types
source: Different item types found
ru: Обнаружены разные типы элементов

source: Insufficient funds
ru: Недостаточно средств

# no_previous_shift
source: No previous shift found
ru: Предыдущая смена не найдена

source: Payments are empty
ru: Платежи отсутствуют

source: Restaurant code not found
ru: Код ресторана не найден

# restaurant_empty_code
source: Restaurant code is empty
ru: Код ресторана пустой

source: Unknown currencies
ru: Неизвестные валюты

source: Unknown discount
ru: Неизвестная скидка

# operation_not_permitted
source: You are not permitted to perform following operations: %1
ru: У вас недостаточно прав для выполнения следующих операций: %1

# division_by_zero
source: Divizion by zero
ru: Деление на ноль

# too_big_value
source: Value is too big
ru: Слишком большое число

# rkd_exch_login_error
source: rkDExch authentication failed. Error code: %1, message: %2
ru: Не удалось авторизоваться в rkDExch. Код ошибки: %1, сообщение: %2

# token_expired
source: Your session token has expired
ru: Срок действия вашего токена истёк

source: Shift is not opened
ru: Смена не открыта

# rkd_exch_fetch_error
source: Failed to fetch from rkDExch. Error code: %1, message: %2
ru: Ошибка при получении данных из rkDExch. Код ошибки: %1, сообщение: %2

# restaurant_dont_have_national_currency_error
source: Restaurant doesn't have national currency
ru: Ресторан не имеет национальной валюты

# currency_not_found_error
source: Currency not found
ru: Валюта не найдена

# restaurant_region_not_found_error
source: Restaurant region not found
ru: Регион ресторана не найден

source: No active license
ru: Нет активной лицензии

# license_error
source: License error. Error code: %1
ru: Ошибка лицензии. Код ошибки: %1

source: License check error
ru: Ошибка проверки лицензии

source: Insufficient rights to make a deposit
ru: Недостаточно прав на внесение депозита

# order_calc_logic_error
source: Order calculation logic error
ru: Логическая ошибка расчета заказа

# payment_without_Link_to_order_pay
source: System error: found a payment calculation without a link to the payment in the order.
ru: Системная ошибка: найден расчет платежа без связи с платежом в заказе

# data_sync_error
source: Failed to sync dictionary %1
ru: Не удалось синхронизировать справочник %1

source: Basic currency not found
ru: Основная валюта не найдена

source: No connected POS terminals found
ru: Не найдено подключенных POS-терминалов

# device_not_found
source: Device with id=%1 not found
ru: Устройство с id=%1 не найдено

source: Multiple devices found
ru: Найдено несколько устройств

# order_not_found
source: Order with id=%1 not found
ru: Заказ с id=%1 не найден

# receipt_not_found
source: Receipt with id=%1 not found
ru: Чек с id=%1 не найден

source: No connected fiscal printers found
ru: Не найдено подключённых фискальных принтеров

# receipt_not_intent_check
source: Receipt is not an intent check
ru: Чек не является чеком намерения

# duplicate_dishes
source: Duplicate dishes detected: %1
ru: Обнаружены дублирующиеся блюда: %1

# duplicate_modifiers
source: Duplicate modifiers detected: %1
ru: Обнаружены дублирующиеся модификаторы: %1

# duplicate_deleted_parts
source: Duplicate deletion reasons detected: %1
ru: Обнаружены дублирующиеся причины удаления: %1

# duplicate_combo_parts
source: Duplicate combo parts detected: %1
ru: Обнаружены дублирующиеся части комбо: %1

# duplicate_discounts
source: Duplicate discounts detected: %1
ru: Обнаружены дублирующиеся скидки: %1

# duplicate_payments
source: Duplicate payments detected: %1
ru: Обнаружены дублирующиеся платежи: %1

# duplicate_receipts
source: Duplicate receipts detected: %1
ru: Обнаружены дублирующиеся чеки: %1

# order_is_not_editable
source: The order cannot be edited
ru: Заказ не может быть отредактирован

# rkd_exch_error
source: Error while working with rkDExch. Error code: %1, message: %2
ru: Ошибка при работе с rkDExch. Код ошибки: %1, сообщение: %2

# modifier_not_found
source: Modifier with id=%1 not found
ru: Модификатор с id=%1 не найден

# device_transaction_error
source: Device error: %1 %2
ru: Ошибка устройства: %1 %2

# device_transaction_error_open_shift_failure
source: Failed to open shift
ru: Ошибка открытия смены

# device_transaction_error_print_receipt_failure
source: Failed to print receipt
ru: Ошибка печати чека

# device_transaction_error_payment_failure
source: Failed to process payment
ru: Ошибка оплаты

# device_transaction_error_close_shift_failure
source: Failed to close shift
ru: Ошибка закрытия смены
